perf-scripts/reports/ddos/2020-03-14T13:56:19.455216-get_user-n2500-c50.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking a7ac0b2a18e3e4d5bb07861ca733b7c2-82784151.eu-central-1.elb.amazonaws.com (be patient)


Server Software:        
Server Hostname:        a7ac0b2a18e3e4d5bb07861ca733b7c2-82784151.eu-central-1.elb.amazonaws.com
Server Port:            80

Document Path:          /users/cc3b71b4-5c1c-4e61-b9bf-8492872277ba
Document Length:        166 bytes

Concurrency Level:      50
Time taken for tests:   99.264 seconds
Complete requests:      2500
Failed requests:        82
   (Connect: 0, Receive: 0, Length: 82, Exceptions: 0)
Non-2xx responses:      82
Total transferred:      767210 bytes
HTML transferred:       408378 bytes
Requests per second:    25.19 [#/sec] (mean)
Time per request:       1985.276 [ms] (mean)
Time per request:       39.706 [ms] (mean, across all concurrent requests)
Transfer rate:          7.55 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       6
Processing:   102 1940 4331.4    692   22652
Waiting:      102 1940 4331.3    692   22649
Total:        105 1940 4331.4    693   22652

Percentage of the requests served within a certain time (ms)
  50%    693
  66%    714
  75%    744
  80%    784
  90%   5886
  95%  12674
  98%  21259
  99%  21408
 100%  22652 (longest request)
