perf-scripts/reports/ddos/2020-03-14T13:58:28.785618-get_user-n2500-c10.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking a7ac0b2a18e3e4d5bb07861ca733b7c2-82784151.eu-central-1.elb.amazonaws.com (be patient)


Server Software:        
Server Hostname:        a7ac0b2a18e3e4d5bb07861ca733b7c2-82784151.eu-central-1.elb.amazonaws.com
Server Port:            80

Document Path:          /users/cc3b71b4-5c1c-4e61-b9bf-8492872277ba
Document Length:        166 bytes

Concurrency Level:      10
Time taken for tests:   76.053 seconds
Complete requests:      2500
Failed requests:        14
   (Connect: 0, Receive: 0, Length: 14, Exceptions: 0)
Non-2xx responses:      14
Total transferred:      771614 bytes
HTML transferred:       413878 bytes
Requests per second:    32.87 [#/sec] (mean)
Time per request:       304.212 [ms] (mean)
Time per request:       30.421 [ms] (mean, across all concurrent requests)
Transfer rate:          9.91 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       3
Processing:    73  303 1310.3    115   16480
Waiting:       73  303 1310.3    115   16480
Total:         74  304 1310.3    116   16480

Percentage of the requests served within a certain time (ms)
  50%    116
  66%    126
  75%    157
  80%    166
  90%    177
  95%    194
  98%   2854
  99%   7067
 100%  16480 (longest request)
