perf-scripts/reports/ddos/2020-03-14T14:00:14.929098-get_image_data-n2500-c100.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking a7ac0b2a18e3e4d5bb07861ca733b7c2-82784151.eu-central-1.elb.amazonaws.com (be patient)


Server Software:        
Server Hostname:        a7ac0b2a18e3e4d5bb07861ca733b7c2-82784151.eu-central-1.elb.amazonaws.com
Server Port:            80

Document Path:          /images/3d277dc7-0762-469d-b079-3b8612f132d4/data
Document Length:        972946 bytes

Concurrency Level:      100
Time taken for tests:   232.116 seconds
Complete requests:      2500
Failed requests:        4
   (Connect: 0, Receive: 0, Length: 4, Exceptions: 0)
Total transferred:      2428865088 bytes
HTML transferred:       2428473216 bytes
Requests per second:    10.77 [#/sec] (mean)
Time per request:       9284.659 [ms] (mean)
Time per request:       92.847 [ms] (mean, across all concurrent requests)
Transfer rate:          10218.74 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0       7
Processing:   227 9167 4191.7   8315   28841
Waiting:        0 2552 4086.5   1114   20006
Total:        228 9168 4192.0   8315   28846

Percentage of the requests served within a certain time (ms)
  50%   8315
  66%   9184
  75%   9774
  80%  10189
  90%  12103
  95%  18618
  98%  25829
  99%  27099
 100%  28846 (longest request)
