perf-scripts/reports/ddos/2020-03-14T14:15:05.596496-get_image_meta-n2500-c10.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking a7ac0b2a18e3e4d5bb07861ca733b7c2-82784151.eu-central-1.elb.amazonaws.com (be patient)


Server Software:        
Server Hostname:        a7ac0b2a18e3e4d5bb07861ca733b7c2-82784151.eu-central-1.elb.amazonaws.com
Server Port:            80

Document Path:          /images/3d277dc7-0762-469d-b079-3b8612f132d4/meta
Document Length:        320 bytes

Concurrency Level:      10
Time taken for tests:   23.645 seconds
Complete requests:      2500
Failed requests:        0
Total transferred:      1157500 bytes
HTML transferred:       800000 bytes
Requests per second:    105.73 [#/sec] (mean)
Time per request:       94.581 [ms] (mean)
Time per request:       9.458 [ms] (mean, across all concurrent requests)
Transfer rate:          47.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       6
Processing:    70   93  31.0     81     333
Waiting:       70   93  30.9     81     333
Total:         71   94  31.0     82     334

Percentage of the requests served within a certain time (ms)
  50%     82
  66%     90
  75%     98
  80%    103
  90%    127
  95%    159
  98%    198
  99%    216
 100%    334 (longest request)
