perf-scripts/reports/ddos/2020-03-14T14:15:32.815570-post_comment-n2500-c100.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking a7ac0b2a18e3e4d5bb07861ca733b7c2-82784151.eu-central-1.elb.amazonaws.com (be patient)


Server Software:        
Server Hostname:        a7ac0b2a18e3e4d5bb07861ca733b7c2-82784151.eu-central-1.elb.amazonaws.com
Server Port:            80

Document Path:          /images/8ff88b5e-d1a0-431a-8cdd-1a82a1a9b1fb/comments
Document Length:        254 bytes

Concurrency Level:      100
Time taken for tests:   19.221 seconds
Complete requests:      2500
Failed requests:        3
   (Connect: 1, Receive: 1, Length: 1, Exceptions: 0)
Total transferred:      1004598 bytes
Total body sent:        1855000
HTML transferred:       634746 bytes
Requests per second:    130.07 [#/sec] (mean)
Time per request:       768.834 [ms] (mean)
Time per request:       7.688 [ms] (mean, across all concurrent requests)
Transfer rate:          51.04 [Kbytes/sec] received
                        94.25 kb/s sent
                        145.29 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   12  16.3      4     140
Processing:    60  725 407.8    682    1946
Waiting:       78  716 405.5    670    1938
Total:         60  737 408.8    693    1947

Percentage of the requests served within a certain time (ms)
  50%    693
  66%    885
  75%   1010
  80%   1093
  90%   1340
  95%   1547
  98%   1678
  99%   1716
 100%   1947 (longest request)
